<?php
// +----------------------------------------------------------------------
// | OpenCMF [ Simple Efficient Excellent ]
// +----------------------------------------------------------------------
// | Copyright (c) 2014 http://www.opencmf.cn All rights reserved.
// +----------------------------------------------------------------------
// | Author: jry <598821125@qq.com>
// +----------------------------------------------------------------------

/**
 * CoreThink数据库连接配置文件
 */

// 开启开发部署模式

// 数据库配置
return array(
    'DB_TYPE'   => 'mysql',       // 数据库类型
    'DB_HOST'   => '127.0.0.1',       // 服务器地址
    'DB_NAME'   => 'jlxh',       // 数据库名
    'DB_USER'   => 'root',       // 用户名
    'DB_PWD'    => 'welcome1',        // 密码
    'DB_PORT'   => '3306',            // 端口
    'DB_PREFIX' => 'jlxh_',     // 数据库表前缀

    'SQL_DETAILS' => array(
        'user' => 'root',
        'pass' => 'welcome1',
        'db'   => 'jlxh',
        'host' => '127.0.0.1'
     ),
);

